app/views/users/_user.html.erb

    <p class="card-text"><%= user.email %></p>
    <p class="card-text">Events Attended <%= user.events.map{ |x| x.title }.join (", ") %></p>
---
SELECT "events".* FROM "events" INNER JOIN "events_users" ON "events"."id" = "events_users"."event_id" WHERE "events_users"."user_id" = $1  [["user_id", 2]]