app/views/users/show.html.erb

    <p class="card-text">Events created</p>
    <% @user.events.each do |event| %>
---
SELECT "events".* FROM "events" INNER JOIN "events_users" ON "events"."id" = "events_users"."event_id" WHERE "events_users"."user_id" = $1  [["user_id", 3]]