app/views/events/_event.html.erb

    <div class="card-block">
      <img src="<%=(event.event_images.first.index) %>" alt="..." class="img-rounded">
---
SELECT "events".* FROM "events"