app/views/events/show.html.erb

SELECT  1 AS one FROM "events" INNER JOIN "events_users" ON "events"."id" = "events_users"."event_id" WHERE "events_users"."user_id" = $1 AND "events"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 2], ["LIMIT", 1]]
---
  <%= link_to "Events", events_path %>
  <% if !current_user.events_attending.include?(@event) %>