app/views/private/index.html.erb

SELECT  "events".* FROM "events" INNER JOIN "events_users" ON "events"."id" = "events_users"."event_id" WHERE "events_users"."user_id" = $1 ORDER BY "events"."id" ASC LIMIT $2  [["user_id", 3], ["LIMIT", 1]]
---
  <div class="row">
    <% current_user.events_attending.each do |event| %>