app/controllers/events_controller.rb

INSERT INTO "events" ("title", "location", "comment", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "wedding"], ["location", "essex"], ["comment", "yaya"], ["user_id", 1], ["created_at", 2016-08-08 10:04:14 UTC], ["updated_at", 2016-08-08 10:04:14 UTC]]
---
  def create
    @event = current_user.events.new(event_params)

    respond_to do |format|
      if @event.save

UPDATE "events" SET "comment" = $1, "updated_at" = $2, "event_images" = $3 WHERE "events"."id" = $4  [["comment", "will will will"], ["updated_at", 2016-08-09 16:02:09 UTC], ["event_images", "{map_of_london.jpg,rio.jpeg,trump_rally.jpeg}"], ["id", 1]]
---
  def update

    # image_array = @event.event_images

    #   if params[:images_to_delete]
    #     params[:images_to_delete].each do |index|
    #       deleted_image = image_array.delete_at(index.to_i)
    #       deleted_image.try(:remove!)
    #     end
    #   end

    #   if params[:event][:event_images].present?
    #     image_array += params[:event][:event_images]
    #   end

    # @event.event_images = image_array

    respond_to do |format|
      if @event.update(event_params)